app/controllers/posts_controller.rb

SELECT `stamps`.* FROM `stamps`
---
  def edit
    @stamps = Stamp.all