app/controllers/posts_controller.rb

  def index
    @posts = Post.includes(:user).order("created_at DESC")
    @stamps = Stamp.all
---
SELECT `posts`.* FROM `posts` ORDER BY created_at DESC
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (2, 1)
SELECT `stamps`.* FROM `stamps` WHERE `stamps`.`post_id` IN ('1', '12', '13', '14', '15', '16')

  def new
    @stamps = Stamp.all
    @posts = Post.all
---
SELECT `stamps`.* FROM `stamps`
SELECT `posts`.* FROM `posts`

  def create
    logger.debug(post_params)
    Post.create(post_params)
---
INSERT INTO `posts` (`stamp_id`, `content`, `created_at`, `updated_at`, `user_id`) VALUES (1, 'test', '2020-06-14 05:33:08', '2020-06-14 05:33:08', 3)

  def destroy
    post = Post.find(params[:id])
    post.destroy
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 30 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 30

  def search
    @posts = Post.search(params[:keyword])
---
SELECT `posts`.* FROM `posts` WHERE (content LIKE('%test%'))