app/controllers/stamps_controller.rb

  def index
    @stamps = Stamp.all
---
SELECT `stamps`.* FROM `stamps`