app/controllers/stamps_controller.rb

  def index
    @stamp = Stamp.find(2)
    @stamp2 = Stamp.find(3)
    @stamp3 = Stamp.find(4)
---
SELECT  `stamps`.* FROM `stamps` WHERE `stamps`.`id` = 1 LIMIT 1
SELECT  `stamps`.* FROM `stamps` WHERE `stamps`.`id` = 3 LIMIT 1
SELECT  `stamps`.* FROM `stamps` WHERE `stamps`.`id` = 4 LIMIT 1